import random
import time
answers = ["Бесспорно!",	"Мне кажется - да...",	"Пока неясно, попробуй снова)",	"Даже не думай!!!",
"Предрешено...",	"Вероятнее всего)",	"Спроси позже:(",	"Мой ответ - нет(",
"Никаких сомнений!",	"Хорошие перспективы:)",	"Лучше не рассказывать!",	"По моим данным - нет...",
"Определённо да",	"Знаки говорят - да",	"Сейчас нельзя предсказать...",	"Перспективы не очень хорошие(",
"Можешь быть уверен в этом)",	"Да!",	"Сконцентрируйся и спроси опять...",	"Весьма сомнительно..."]
print("Привет, Мир!")
time.sleep(1)
print("Я магический шар, и я знаю ответ на любой твой вопрос, кроме твоего имени...")
time.sleep(1)
print("Скажи, как тебя зовут!")
name = input()
print("Привет, " + name.capitalize() + "!")
time.sleep(1)
while True:
    print("Задай тревожащий тебя вопрос, на который ты хочешь получить ответ:)")
    time.sleep(1)
    question = input()
    print(random.choice(answers))
    print("Хочешь ли ты задать еще еще вопрос? Ответь только 'да' или 'нет'")
    answer = input()
    answer = answer.lower()
    if answer == "да":
        continue
    else:
        print("Возвращайся если возникнут вопросы!")
        break
